Revit 2027 API
DividedSurface.RemoveIntersectionElement Method
 Removes an intersection element from a divided surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveIntersectionElement(
	ElementId referenceElemIdToRemove
)
Public Sub RemoveIntersectionElement (
	referenceElemIdToRemove As ElementId
)
public:
void RemoveIntersectionElement(
	ElementId^ referenceElemIdToRemove
)
member RemoveIntersectionElement :
        referenceElemIdToRemove : ElementId -> unit
Parameters
referenceElemIdToRemove ElementId
 The intersection element to be removed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace